; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-34)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room6)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room6)
(at ball29 room6)
(at ball30 room6)
(at ball31 room6)
(at ball32 room6)
(at ball33 room6)
(at ball34 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 29 of 34
2. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 29 of 34
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 29 of 34
4. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 30 of 34
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 30 of 34
6. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 30 of 34
7. (pick ball27 room6 left)
   deleted: (at ball27 room6) (free left)
   added: (carry ball27 left)
   goals met: 30 of 34
8. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 30 of 34
9. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 30 of 34
10. (drop ball27 room5 left)
   deleted: (carry ball27 left)
   added: (at ball27 room5) (free left)
   goals met: 31 of 34
11. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 31 of 34
12. (pick ball21 room4 left)
   deleted: (at ball21 room4) (free left)
   added: (carry ball21 left)
   goals met: 31 of 34
13. (pick ball20 room4 right)
   deleted: (at ball20 room4) (free right)
   added: (carry ball20 right)
   goals met: 31 of 34
14. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 31 of 34
15. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 31 of 34
16. (drop ball20 room5 right)
   deleted: (carry ball20 right)
   added: (at ball20 room5) (free right)
   goals met: 32 of 34
17. (drop ball21 room5 left)
   deleted: (carry ball21 left)
   added: (at ball21 room5) (free left)
   goals met: 33 of 34
18. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 33 of 34
19. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 33 of 34
20. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 33 of 34
21. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 33 of 34
22. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 34 of 34
